---
type: CurveExtents
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# CurveExtents

`Autodesk.Revit.DB.CurveExtents` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | EndParameter | 2013 | `public double EndParameter { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | StartParameter | 2013 | `public double StartParameter { get ; }` |